jdesbonnet/codex_experiment_06/projects/ultrasonic_ranger/lpc824_c/main.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "fsl_device_registers.h"

/*
 * GCC-native port of the legacy LPCXpresso/LPCOpen ultrasonic ranger:
 * `LPC824_Ultrasonic_Ranger/src/LPC824_Ultrasonic_Ranger.c`
 *
 * This version adds a lightweight UART control protocol using AT-style
 * commands while preserving the original compact `W ` waveform stream format
 * as the default output.
 */

#ifndef ULTRASONIC_UART_BAUD_RATE
#define ULTRASONIC_UART_BAUD_RATE 230400u
#endif

#ifndef ULTRASONIC_ADC_CHANNEL
#define ULTRASONIC_ADC_CHANNEL 3u
#endif

#ifndef ULTRASONIC_ADC_SAMPLE_RATE_DEFAULT
#define ULTRASONIC_ADC_SAMPLE_RATE_DEFAULT 500000u
#endif

#ifndef ULTRASONIC_TRANSDUCER_FREQUENCY_DEFAULT
#define ULTRASONIC_TRANSDUCER_FREQUENCY_DEFAULT 40000u
#endif

#ifndef ULTRASONIC_PULSE_CYCLE_COUNT_DEFAULT
#define ULTRASONIC_PULSE_CYCLE_COUNT_DEFAULT 1u
#endif

#ifndef ULTRASONIC_DMA_BUFFER_SIZE
#define ULTRASONIC_DMA_BUFFER_SIZE 1024u
#endif

#define ULTRASONIC_SAMPLE_COUNT (ULTRASONIC_DMA_BUFFER_SIZE * 3u)
#define ULTRASONIC_PROTOCOL_VERSION 1u
#define AT_COMMAND_BUFFER_SIZE 96u
#define AT_TXFREQ_MIN_HZ 1000u
#define AT_TXFREQ_MAX_HZ 100000u
#define AT_TXCYCLES_MIN 1u
#define AT_TXCYCLES_MAX 255u
#define AT_SRATE_MIN_HZ 10000u
#define AT_SRATE_MAX_HZ 1000000u

#define PIN_UART_RXD 0u
#define PIN_UART_TXD 4u
#define PIN_DEBUG 14u
#define PIN_TRANSDUCER_TX_A 15u
#define PIN_TRANSDUCER_TX_B 9u

#define DMA_CHANNEL_ADC 0u
#define ADC_SEQUENCE_A 0u

typedef struct {
    uint32_t xfercfg;
    uint32_t source;
    uint32_t dest;
    uint32_t next;
} dma_descriptor_t;

typedef enum {
    CAPTURE_MODE_SINGLE = 0,
    CAPTURE_MODE_NSHOT,
    CAPTURE_MODE_CONTINUOUS,
} capture_mode_t;

typedef enum {
    OUTPUT_FORMAT_COMPACT = 0,
    OUTPUT_FORMAT_TEXT,
    OUTPUT_FORMAT_BIN,
} output_format_t;

typedef struct {
    capture_mode_t mode;
    output_format_t format;
    uint32_t nshot;
    uint32_t tx_frequency_hz;
    uint32_t tx_cycles;
    uint32_t adc_sample_rate_hz;
    uint32_t sample_count;
} ultrasonic_config_t;

_Static_assert(sizeof(dma_descriptor_t) == 16u, "Unexpected DMA descriptor size");

static dma_descriptor_t g_dma_table[DMA_CHANNEL_COUNT] __attribute__((aligned(512)));
static dma_descriptor_t g_dma_desc_b __attribute__((aligned(16)));
static dma_descriptor_t g_dma_desc_c __attribute__((aligned(16)));

static uint16_t g_adc_buffer[ULTRASONIC_SAMPLE_COUNT];

static volatile uint32_t g_dma_block_count;
static volatile uint32_t g_pulse_cycle_count;

static ultrasonic_config_t g_config = {
    .mode = CAPTURE_MODE_CONTINUOUS,
    .format = OUTPUT_FORMAT_COMPACT,
    .nshot = 1u,
    .tx_frequency_hz = ULTRASONIC_TRANSDUCER_FREQUENCY_DEFAULT,
    .tx_cycles = ULTRASONIC_PULSE_CYCLE_COUNT_DEFAULT,
    .adc_sample_rate_hz = ULTRASONIC_ADC_SAMPLE_RATE_DEFAULT,
    .sample_count = ULTRASONIC_SAMPLE_COUNT,
};
static const ultrasonic_config_t g_default_config = {
    .mode = CAPTURE_MODE_CONTINUOUS,
    .format = OUTPUT_FORMAT_COMPACT,
    .nshot = 1u,
    .tx_frequency_hz = ULTRASONIC_TRANSDUCER_FREQUENCY_DEFAULT,
    .tx_cycles = ULTRASONIC_PULSE_CYCLE_COUNT_DEFAULT,
    .adc_sample_rate_hz = ULTRASONIC_ADC_SAMPLE_RATE_DEFAULT,
    .sample_count = ULTRASONIC_SAMPLE_COUNT,
};

static bool g_continuous_active = true;
static uint32_t g_pending_frames = 0u;
static uint32_t g_frame_sequence = 0u;
static char g_command_buffer[AT_COMMAND_BUFFER_SIZE];
static char g_pending_command_buffer[AT_COMMAND_BUFFER_SIZE];
static uint32_t g_command_length = 0u;
static bool g_command_overflow = false;
static bool g_pending_command_ready = false;
static bool g_pending_command_toolong = false;
static bool g_pending_command_dropped = false;

static void pump_uart_rx(void);
static void service_pending_command(void);

static inline uint32_t pin_mask(uint32_t pin)
{
    return 1u << pin;
}

static inline uint32_t dma_channel_mask(uint32_t channel)
{
    return 1u << channel;
}

static inline void enable_clock(uint32_t mask)
{
    SYSCON->SYSAHBCLKCTRL |= mask;
}

static inline void peripheral_reset(uint32_t mask)
{
    SYSCON->PRESETCTRL &= ~mask;
    SYSCON->PRESETCTRL |= mask;
}

static inline void gpio_set_output(uint32_t pin)
{
    GPIO->DIRSET[0] = pin_mask(pin);
}

static inline void gpio_write(uint32_t pin, bool state)
{
    if (state) {
        GPIO->SET[0] = pin_mask(pin);
    } else {
        GPIO->CLR[0] = pin_mask(pin);
    }
}

static void debug_pin_pulse(uint32_t count)
{
    for (uint32_t i = 0; i < count; ++i) {
        gpio_write(PIN_DEBUG, true);
        gpio_write(PIN_DEBUG, false);
    }
}

static const char *mode_to_string(capture_mode_t mode)
{
    switch (mode) {
    case CAPTURE_MODE_SINGLE:
        return "SINGLE";
    case CAPTURE_MODE_NSHOT:
        return "NSHOT";
    case CAPTURE_MODE_CONTINUOUS:
        return "CONTINUOUS";
    default:
        return "UNKNOWN";
    }
}

static const char *format_to_string(output_format_t format)
{
    switch (format) {
    case OUTPUT_FORMAT_COMPACT:
        return "COMPACT";
    case OUTPUT_FORMAT_TEXT:
        return "TEXT";
    case OUTPUT_FORMAT_BIN:
        return "BIN";
    default:
        return "UNKNOWN";
    }
}

static bool parse_u32(const char *text, uint32_t *value_out)
{
    uint32_t value = 0u;
    const char *cursor = text;

    if (*cursor == '\0') {
        return false;
    }

    while (*cursor != '\0') {
        const char ch = *cursor++;
        if (ch < '0' || ch > '9') {
            return false;
        }
        value = (value * 10u) + (uint32_t)(ch - '0');
    }

    *value_out = value;
    return true;
}

static bool string_equals(const char *lhs, const char *rhs)
{
    return strcmp(lhs, rhs) == 0;
}

static bool string_starts_with(const char *text, const char *prefix)
{
    const size_t prefix_len = strlen(prefix);
    return strncmp(text, prefix, prefix_len) == 0;
}

static void usart0_assign_pins(void)
{
    uint32_t reg = SWM0->PINASSIGN.PINASSIGN0;

    reg &= ~(SWM_PINASSIGN0_U0_TXD_O_MASK | SWM_PINASSIGN0_U0_RXD_I_MASK);
    reg |= SWM_PINASSIGN0_U0_TXD_O(PIN_UART_TXD);
    reg |= SWM_PINASSIGN0_U0_RXD_I(PIN_UART_RXD);
    SWM0->PINASSIGN.PINASSIGN0 = reg;
}

static void sct_assign_transducer_pins(void)
{
    uint32_t reg7 = SWM0->PINASSIGN.PINASSIGN7;
    uint32_t reg8 = SWM0->PINASSIGN.PINASSIGN8;

    reg7 &= ~SWM_PINASSIGN7_SCT_OUT0_O_MASK;
    reg7 |= SWM_PINASSIGN7_SCT_OUT0_O(PIN_TRANSDUCER_TX_A);
    SWM0->PINASSIGN.PINASSIGN7 = reg7;

