jdesbonnet/codex_experiment_06/projects/ultrasonic_ranger/lpc824_c/main.c
    reg8 &= ~SWM_PINASSIGN8_SCT_OUT1_O_MASK;
    reg8 |= SWM_PINASSIGN8_SCT_OUT1_O(PIN_TRANSDUCER_TX_B);
    SWM0->PINASSIGN.PINASSIGN8 = reg8;
}

static void adc3_enable_fixed_pin(void)
{
    SWM0->PINENABLE0 &= ~SWM_PINENABLE0_ADC_3_MASK;
}

static void usart0_configure_baud(uint32_t baud_rate)
{
    uint64_t best_error = UINT64_MAX;
    uint32_t best_brg = 0u;
    uint32_t best_mult = 0u;

    SYSCON->UARTCLKDIV = SYSCON_UARTCLKDIV_DIV(1u);
    SYSCON->UARTFRGDIV = SYSCON_UARTFRGDIV_DIV(0xFFu);

    for (uint32_t mult = 0u; mult <= 0xFFu; ++mult) {
        const uint64_t numerator = (uint64_t)SystemCoreClock * 256u;
        const uint64_t denominator = (uint64_t)(256u + mult) * 16u * baud_rate;
        uint64_t brg_plus_one;
        uint64_t actual_baud;
        uint64_t error;

        if (denominator == 0u) {
            continue;
        }

        brg_plus_one = (numerator + (denominator / 2u)) / denominator;
        if (brg_plus_one == 0u) {
            brg_plus_one = 1u;
        }
        if (brg_plus_one > 65536u) {
            brg_plus_one = 65536u;
        }

        actual_baud = (numerator + (((uint64_t)(256u + mult) * 16u * brg_plus_one) / 2u)) /
                      ((uint64_t)(256u + mult) * 16u * brg_plus_one);

        error = (actual_baud > baud_rate) ? (actual_baud - baud_rate) : (baud_rate - actual_baud);
        if (error < best_error) {
            best_error = error;
            best_brg = (uint32_t)(brg_plus_one - 1u);
            best_mult = mult;
            if (error == 0u) {
                break;
            }
        }
    }

    USART0->OSR = USART_OSR_OSRVAL(15u);
    SYSCON->UARTFRGMULT = SYSCON_UARTFRGMULT_MULT(best_mult);
    USART0->BRG = USART_BRG_BRGVAL(best_brg);
}

static void usart0_init(void)
{
    enable_clock(SYSCON_SYSAHBCLKCTRL_SWM_MASK | SYSCON_SYSAHBCLKCTRL_UART0_MASK);
    peripheral_reset(SYSCON_PRESETCTRL_UARTFRG_RST_N_MASK | SYSCON_PRESETCTRL_UART0_RST_N_MASK);

    usart0_assign_pins();

    USART0->CFG = USART_CFG_DATALEN(1u) | USART_CFG_PARITYSEL(0u) | USART_CFG_STOPLEN(0u);
    USART0->CTL = 0u;
    usart0_configure_baud(ULTRASONIC_UART_BAUD_RATE);
    USART0->CFG |= USART_CFG_ENABLE_MASK;
}

static bool uart_rx_ready(void)
{
    return (USART0->STAT & USART_STAT_RXRDY_MASK) != 0u;
}

static uint8_t uart_read_byte(void)
{
    return (uint8_t)((USART0->RXDAT & USART_RXDAT_RXDAT_MASK) >> USART_RXDAT_RXDAT_SHIFT);
}

static void uart_write_byte(uint8_t byte)
{
    while ((USART0->STAT & USART_STAT_TXRDY_MASK) == 0u) {
        pump_uart_rx();
    }

    USART0->TXDAT = USART_TXDAT_TXDAT(byte);
    pump_uart_rx();
}

static void uart_write_data(const uint8_t *data, uint32_t length)
{
    for (uint32_t i = 0u; i < length; ++i) {
        uart_write_byte(data[i]);
    }
}

static void uart_write_decimal(uint32_t value)
{
    char buffer[12];
    uint32_t i = 0u;

    if (value == 0u) {
        uart_write_byte('0');
        return;
    }

    while (value > 0u) {
        buffer[i++] = (char)('0' + (value % 10u));
        value /= 10u;
    }

    while (i > 0u) {
        uart_write_byte((uint8_t)buffer[--i]);
    }
}

static void uart_write_string(const char *s)
{
    while (*s != '\0') {
        uart_write_byte((uint8_t)*s++);
    }
}

static void uart_write_crlf(void)
{
    uart_write_byte('\r');
    uart_write_byte('\n');
}

static void emit_ok(void)
{
    uart_write_string("OK");
    uart_write_crlf();
}

static void emit_error(const char *reason)
{
    uart_write_string("ERROR");
    if (reason != NULL && *reason != '\0') {
        uart_write_byte(':');
        uart_write_string(reason);
    }
    uart_write_crlf();
}

static void emit_info(void)
{
    uart_write_string("+INFO: proto=");
    uart_write_decimal(ULTRASONIC_PROTOCOL_VERSION);
    uart_write_string(",target=LPC824,fw=ultrasonic_ranger");
    uart_write_crlf();
}

static void emit_config(void)
{
    uart_write_string("+CFG: mode=");
    uart_write_string(mode_to_string(g_config.mode));
    uart_write_string(",nshot=");
    uart_write_decimal(g_config.nshot);
    uart_write_string(",fmt=");
    uart_write_string(format_to_string(g_config.format));
    uart_write_string(",txfreq=");
    uart_write_decimal(g_config.tx_frequency_hz);
    uart_write_string(",txcycles=");
    uart_write_decimal(g_config.tx_cycles);
    uart_write_string(",srate=");
    uart_write_decimal(g_config.adc_sample_rate_hz);
    uart_write_string(",samples=");
    uart_write_decimal(g_config.sample_count);
    uart_write_crlf();
}

static void emit_done_frames(uint32_t frame_count)
{
    uart_write_string("+DONE: frames=");
    uart_write_decimal(frame_count);
    uart_write_crlf();
}

static void emit_done_stopped(void)
{
    uart_write_string("+DONE: stopped");
    uart_write_crlf();
}

static void emit_query_value(const char *name, const char *value)
{
    uart_write_byte('+');
    uart_write_string(name);
    uart_write_string(": ");
    uart_write_string(value);
    uart_write_crlf();
}

static void emit_query_value_u32(const char *name, uint32_t value)
{
    uart_write_byte('+');
    uart_write_string(name);
    uart_write_string(": ");
    uart_write_decimal(value);
    uart_write_crlf();
}

static bool capture_is_active(void)
{
    return g_continuous_active || (g_pending_frames > 0u);
}

static void sct_halt(void)
{
    SCT0->CTRL |= SCT_CTRLL_HALT_L_MASK;
}

static void sct_run(void)
{
    SCT0->CTRL &= ~SCT_CTRLL_HALT_L_MASK;
}

static void sct_reset_block(void)
{
    enable_clock(SYSCON_SYSAHBCLKCTRL_SCT_MASK);
    peripheral_reset(SYSCON_PRESETCTRL_SCT_RST_N_MASK);
    sct_halt();
    SCT0->CTRL |= SCT_CTRLL_CLRCTR_L_MASK;
    SCT0->CTRL &= ~SCT_CTRLL_CLRCTR_L_MASK;
    SCT0->CONFIG = SCT_CONFIG_UNIFY(1u) | SCT_CONFIG_AUTOLIMIT_L(1u);
    SCT0->REGMODE = 0u;
    SCT0->OUTPUTDIRCTRL = 0u;
    SCT0->RES = 1u << 0;
    SCT0->EVFLAG = 0xFFFFFFFFu;
    SCT0->EVEN = 0u;
}

static void sct_configure_match_event(uint32_t event_index, uint32_t match_index)
{
    SCT0->EV[event_index].CTRL = SCT_EV_CTRL_MATCHSEL(match_index) | SCT_EV_CTRL_COMBMODE(1u);
    SCT0->EV[event_index].STATE = SCT_EV_STATE_STATEMSKn(1u);
}

static void sct_set_match(uint32_t match_index, uint32_t value)
{
    SCT0->MATCH[match_index] = value;
    SCT0->MATCHREL[match_index] = value;
}

static void setup_sct_for_transducer(void)
{
    const uint32_t half_period_ticks = SystemCoreClock / (g_config.tx_frequency_hz * 2u);

    sct_reset_block();
    sct_assign_transducer_pins();

    sct_configure_match_event(0u, 0u);
    sct_configure_match_event(2u, 2u);

