jdesbonnet/codex_experiment_06/projects/ultrasonic_ranger/lpc824_c/main.c
    sct_set_match(2u, half_period_ticks);
    sct_set_match(0u, half_period_ticks * 2u);

    SCT0->OUT[0].SET = 1u << 0;
    SCT0->OUT[0].CLR = 1u << 2;
    SCT0->OUT[1].SET = 1u << 2;
    SCT0->OUT[1].CLR = 1u << 0;

    SCT0->EVFLAG = 0xFFFFFFFFu;
    SCT0->EVEN = 1u << 0;
    NVIC_ClearPendingIRQ(SCT0_IRQn);
    NVIC_EnableIRQ(SCT0_IRQn);
}

static void setup_sct_for_adc(void)
{
    const uint32_t half_period_ticks = SystemCoreClock / (g_config.adc_sample_rate_hz * 2u);

    sct_reset_block();

    sct_configure_match_event(0u, 0u);
    sct_configure_match_event(2u, 2u);

    sct_set_match(2u, half_period_ticks);
    sct_set_match(0u, half_period_ticks * 2u);

    SCT0->OUT[3].SET = 1u << 0;
    SCT0->OUT[3].CLR = 1u << 2;

    NVIC_DisableIRQ(SCT0_IRQn);
}

static uint32_t dma_xfercfg(uint32_t transfer_count, bool reload, bool interrupt_a)
{
    uint32_t cfg = DMA_CHANNEL_XFERCFG_CFGVALID(1u) |
                   DMA_CHANNEL_XFERCFG_WIDTH(1u) |
                   DMA_CHANNEL_XFERCFG_SRCINC(0u) |
                   DMA_CHANNEL_XFERCFG_DSTINC(1u) |
                   DMA_CHANNEL_XFERCFG_XFERCOUNT(transfer_count - 1u);

    if (reload) {
        cfg |= DMA_CHANNEL_XFERCFG_RELOAD(1u);
    }
    if (interrupt_a) {
        cfg |= DMA_CHANNEL_XFERCFG_SETINTA(1u);
    }

    return cfg;
}

static void setup_dma_for_adc(void)
{
    const uint32_t sample_reg = (uint32_t)&ADC0->DAT[ULTRASONIC_ADC_CHANNEL];
    const uint32_t channel_mask = dma_channel_mask(DMA_CHANNEL_ADC);

    enable_clock(SYSCON_SYSAHBCLKCTRL_DMA_MASK);
    peripheral_reset(SYSCON_PRESETCTRL_DMA_RST_N_MASK);

    g_dma_desc_c.xfercfg = dma_xfercfg(ULTRASONIC_DMA_BUFFER_SIZE, false, true);
    g_dma_desc_c.source = sample_reg;
    g_dma_desc_c.dest = (uint32_t)&g_adc_buffer[(ULTRASONIC_DMA_BUFFER_SIZE * 3u) - 1u];
    g_dma_desc_c.next = 0u;

    g_dma_desc_b.xfercfg = dma_xfercfg(ULTRASONIC_DMA_BUFFER_SIZE, true, true);
    g_dma_desc_b.source = sample_reg;
    g_dma_desc_b.dest = (uint32_t)&g_adc_buffer[(ULTRASONIC_DMA_BUFFER_SIZE * 2u) - 1u];
    g_dma_desc_b.next = (uint32_t)&g_dma_desc_c;

    g_dma_table[DMA_CHANNEL_ADC].xfercfg = dma_xfercfg(ULTRASONIC_DMA_BUFFER_SIZE, true, true);
    g_dma_table[DMA_CHANNEL_ADC].source = sample_reg;
    g_dma_table[DMA_CHANNEL_ADC].dest = (uint32_t)&g_adc_buffer[ULTRASONIC_DMA_BUFFER_SIZE - 1u];
    g_dma_table[DMA_CHANNEL_ADC].next = (uint32_t)&g_dma_desc_b;

    DMA0->CTRL = DMA_CTRL_ENABLE(1u);
    DMA0->SRAMBASE = DMA_SRAMBASE_OFFSET(((uint32_t)g_dma_table) >> DMA_SRAMBASE_OFFSET_SHIFT);

    DMA0->COMMON[0].ENABLECLR = channel_mask;
    DMA0->COMMON[0].ABORT = channel_mask;
    DMA0->COMMON[0].INTA = channel_mask;
    DMA0->COMMON[0].INTB = channel_mask;
    DMA0->COMMON[0].ERRINT = channel_mask;
    DMA0->COMMON[0].INTENSET = channel_mask;

    DMA0->CHANNEL[DMA_CHANNEL_ADC].CFG =
        DMA_CHANNEL_CFG_HWTRIGEN(1u) |
        DMA_CHANNEL_CFG_TRIGPOL(1u) |
        DMA_CHANNEL_CFG_TRIGTYPE(0u) |
        DMA_CHANNEL_CFG_TRIGBURST(1u) |
        DMA_CHANNEL_CFG_BURSTPOWER(0u) |
        DMA_CHANNEL_CFG_CHPRIORITY(0u);
    DMA0->CHANNEL[DMA_CHANNEL_ADC].XFERCFG = g_dma_table[DMA_CHANNEL_ADC].xfercfg;

    INPUTMUX->DMA_ITRIG_INMUX[DMA_CHANNEL_ADC] = INPUTMUX_DMA_ITRIG_INMUX_INP(0u);

    DMA0->COMMON[0].SETVALID = channel_mask;
    DMA0->COMMON[0].ENABLESET = channel_mask;

    NVIC_ClearPendingIRQ(DMA0_IRQn);
    NVIC_EnableIRQ(DMA0_IRQn);
}

static void adc_init(void)
{
    enable_clock(SYSCON_SYSAHBCLKCTRL_IOCON_MASK |
                 SYSCON_SYSAHBCLKCTRL_SWM_MASK |
                 SYSCON_SYSAHBCLKCTRL_ADC_MASK);
    peripheral_reset(SYSCON_PRESETCTRL_ADC_RST_N_MASK);

    SYSCON->PDAWAKECFG &= ~SYSCON_PDAWAKECFG_ADC_PD_MASK;
    SYSCON->PDRUNCFG &= ~SYSCON_PDRUNCFG_ADC_PD_MASK;

    IOCON->PIO[IOCON_INDEX_PIO0_23] =
        (IOCON->PIO[IOCON_INDEX_PIO0_23] & ~IOCON_PIO_MODE_MASK) |
        IOCON_PIO_MODE(0u);

    adc3_enable_fixed_pin();

    ADC0->CTRL = ADC_CTRL_CLKDIV(0u);
    ADC0->CTRL |= ADC_CTRL_CALMODE(1u);
    while ((ADC0->CTRL & ADC_CTRL_CALMODE_MASK) != 0u) {
    }

    ADC0->SEQ_CTRL[ADC_SEQUENCE_A] =
        ADC_SEQ_CTRL_CHANNELS(1u << ULTRASONIC_ADC_CHANNEL) |
        ADC_SEQ_CTRL_TRIGGER(3u) |
        ADC_SEQ_CTRL_MODE(1u) |
        ADC_SEQ_CTRL_SEQ_ENA(1u);
    ADC0->INTEN = ADC_INTEN_SEQA_INTEN(1u);
    ADC0->FLAGS = 0xFFFFFFFFu;
}

static void capture_frame(void)
{
    setup_sct_for_transducer();
    g_pulse_cycle_count = 0u;
    debug_pin_pulse(2u);
    sct_run();
    while (g_pulse_cycle_count < g_config.tx_cycles) {
        pump_uart_rx();
        __WFI();
    }
    sct_halt();

    setup_dma_for_adc();
    setup_sct_for_adc();

    g_dma_block_count = 0u;
    sct_run();
    while (g_dma_block_count < 3u) {
        pump_uart_rx();
        __WFI();
    }
    sct_halt();

    for (uint32_t i = 0u; i < ULTRASONIC_SAMPLE_COUNT; ++i) {
        g_adc_buffer[i] >>= 4u;
    }
}

static void emit_frame_compact(void)
{
    uart_write_byte('W');
    uart_write_byte(' ');
    for (uint32_t i = 0u; i < ULTRASONIC_SAMPLE_COUNT; ++i) {
        if ((i & 0x1Fu) == 0u) {
            pump_uart_rx();
        }
        uart_write_byte((uint8_t)(((g_adc_buffer[i] >> 6u) & 0x3Fu) + '?'));
        uart_write_byte((uint8_t)((g_adc_buffer[i] & 0x3Fu) + '?'));
    }
    uart_write_crlf();
}

static void emit_frame_text(void)
{
    uart_write_string("T seq=");
    uart_write_decimal(g_frame_sequence);
    uart_write_string(" count=");
    uart_write_decimal(ULTRASONIC_SAMPLE_COUNT);
    uart_write_byte(' ');
    for (uint32_t i = 0u; i < ULTRASONIC_SAMPLE_COUNT; ++i) {
        if ((i & 0x1Fu) == 0u) {
            pump_uart_rx();
        }
        uart_write_decimal(g_adc_buffer[i]);
        if (i + 1u < ULTRASONIC_SAMPLE_COUNT) {
            uart_write_byte(',');
        }
    }
    uart_write_crlf();
}

static uint16_t crc16_ccitt_update(uint16_t crc, uint8_t data)
{
    crc ^= (uint16_t)data << 8u;
    for (uint32_t i = 0u; i < 8u; ++i) {
        if ((crc & 0x8000u) != 0u) {
            crc = (uint16_t)((crc << 1u) ^ 0x1021u);
        } else {
            crc <<= 1u;
        }
    }
    return crc;
}

static void emit_frame_binary(void)
{
    const uint16_t payload_len = (uint16_t)((ULTRASONIC_SAMPLE_COUNT / 2u) * 3u);
    uint16_t crc = 0xFFFFu;
    const uint8_t header[12] = {
        0x55u,
        0x57u,
        0x01u,
        0x01u,
        (uint8_t)(g_frame_sequence & 0xFFu),
        (uint8_t)((g_frame_sequence >> 8u) & 0xFFu),
        (uint8_t)((g_frame_sequence >> 16u) & 0xFFu),
        (uint8_t)((g_frame_sequence >> 24u) & 0xFFu),
        (uint8_t)(ULTRASONIC_SAMPLE_COUNT & 0xFFu),
        (uint8_t)((ULTRASONIC_SAMPLE_COUNT >> 8u) & 0xFFu),
        (uint8_t)(payload_len & 0xFFu),
        (uint8_t)((payload_len >> 8u) & 0xFFu),
    };

    uart_write_data(header, sizeof(header));
    for (uint32_t i = 0u; i < sizeof(header); ++i) {
        crc = crc16_ccitt_update(crc, header[i]);
    }

    for (uint32_t i = 0u; i < ULTRASONIC_SAMPLE_COUNT; i += 2u) {
        if ((i & 0x3Fu) == 0u) {
            pump_uart_rx();
        }
        const uint16_t sample_a = (uint16_t)(g_adc_buffer[i] & 0x0FFFu);
        const uint16_t sample_b = (uint16_t)(g_adc_buffer[i + 1u] & 0x0FFFu);
        const uint8_t packed[3] = {
            (uint8_t)(sample_a & 0xFFu),
            (uint8_t)(((sample_a >> 8u) & 0x0Fu) | ((sample_b & 0x0Fu) << 4u)),
            (uint8_t)((sample_b >> 4u) & 0xFFu),
        };
        uart_write_data(packed, 3u);
        crc = crc16_ccitt_update(crc, packed[0]);
        crc = crc16_ccitt_update(crc, packed[1]);
        crc = crc16_ccitt_update(crc, packed[2]);
    }

    uart_write_byte((uint8_t)(crc & 0xFFu));
    uart_write_byte((uint8_t)((crc >> 8u) & 0xFFu));
}

