jdesbonnet/codex_experiment_06/projects/ultrasonic_ranger/lpc824_c/main.c
static void emit_current_frame(void)
{
    ++g_frame_sequence;
    switch (g_config.format) {
    case OUTPUT_FORMAT_COMPACT:
        emit_frame_compact();
        break;
    case OUTPUT_FORMAT_TEXT:
        emit_frame_text();
        break;
    case OUTPUT_FORMAT_BIN:
        emit_frame_binary();
        break;
    default:
        emit_error("FORMAT");
        break;
    }
}

static void apply_default_configuration(void)
{
    g_config = g_default_config;
    g_continuous_active = false;
    g_pending_frames = 0u;
}

static void handle_command(const char *line)
{
    if (string_equals(line, "AT")) {
        emit_ok();
        return;
    }

    if (string_equals(line, "ATI")) {
        emit_info();
        emit_ok();
        return;
    }

    if (string_equals(line, "ATCFG?")) {
        emit_config();
        emit_ok();
        return;
    }

    if (string_equals(line, "ATMODE?")) {
        emit_query_value("MODE", mode_to_string(g_config.mode));
        emit_ok();
        return;
    }

    if (string_starts_with(line, "ATMODE=")) {
        if (capture_is_active()) {
            emit_error("BUSY");
            return;
        }
        const char *value = line + strlen("ATMODE=");
        if (string_equals(value, "SINGLE")) {
            g_config.mode = CAPTURE_MODE_SINGLE;
        } else if (string_equals(value, "NSHOT")) {
            g_config.mode = CAPTURE_MODE_NSHOT;
        } else if (string_equals(value, "CONTINUOUS")) {
            g_config.mode = CAPTURE_MODE_CONTINUOUS;
        } else {
            emit_error("BADARG");
            return;
        }
        emit_ok();
        return;
    }

    if (string_equals(line, "ATNSHOT?")) {
        emit_query_value_u32("NSHOT", g_config.nshot);
        emit_ok();
        return;
    }

    if (string_starts_with(line, "ATNSHOT=")) {
        uint32_t value;
        if (capture_is_active()) {
            emit_error("BUSY");
            return;
        }
        if (!parse_u32(line + strlen("ATNSHOT="), &value) || value == 0u) {
            emit_error("BADARG");
            return;
        }
        g_config.nshot = value;
        emit_ok();
        return;
    }

    if (string_equals(line, "ATFMT?")) {
        emit_query_value("FMT", format_to_string(g_config.format));
        emit_ok();
        return;
    }

    if (string_starts_with(line, "ATFMT=")) {
        if (capture_is_active()) {
            emit_error("BUSY");
            return;
        }
        const char *value = line + strlen("ATFMT=");
        if (string_equals(value, "COMPACT")) {
            g_config.format = OUTPUT_FORMAT_COMPACT;
        } else if (string_equals(value, "TEXT")) {
            g_config.format = OUTPUT_FORMAT_TEXT;
        } else if (string_equals(value, "BIN")) {
            g_config.format = OUTPUT_FORMAT_BIN;
        } else {
            emit_error("BADARG");
            return;
        }
        emit_ok();
        return;
    }

    if (string_equals(line, "ATTXFREQ?")) {
        emit_query_value_u32("TXFREQ", g_config.tx_frequency_hz);
        emit_ok();
        return;
    }

    if (string_starts_with(line, "ATTXFREQ=")) {
        uint32_t value;
        if (capture_is_active()) {
            emit_error("BUSY");
            return;
        }
        if (!parse_u32(line + strlen("ATTXFREQ="), &value)) {
            emit_error("BADARG");
            return;
        }
        if (value < AT_TXFREQ_MIN_HZ || value > AT_TXFREQ_MAX_HZ) {
            emit_error("RANGE");
            return;
        }
        g_config.tx_frequency_hz = value;
        emit_ok();
        return;
    }

    if (string_equals(line, "ATTXCYCLES?")) {
        emit_query_value_u32("TXCYCLES", g_config.tx_cycles);
        emit_ok();
        return;
    }

    if (string_starts_with(line, "ATTXCYCLES=")) {
        uint32_t value;
        if (capture_is_active()) {
            emit_error("BUSY");
            return;
        }
        if (!parse_u32(line + strlen("ATTXCYCLES="), &value)) {
            emit_error("BADARG");
            return;
        }
        if (value < AT_TXCYCLES_MIN || value > AT_TXCYCLES_MAX) {
            emit_error("RANGE");
            return;
        }
        g_config.tx_cycles = value;
        emit_ok();
        return;
    }

    if (string_equals(line, "ATSRATE?")) {
        emit_query_value_u32("SRATE", g_config.adc_sample_rate_hz);
        emit_ok();
        return;
    }

    if (string_starts_with(line, "ATSRATE=")) {
        uint32_t value;
        if (capture_is_active()) {
            emit_error("BUSY");
            return;
        }
        if (!parse_u32(line + strlen("ATSRATE="), &value)) {
            emit_error("BADARG");
            return;
        }
        if (value < AT_SRATE_MIN_HZ || value > AT_SRATE_MAX_HZ) {
            emit_error("RANGE");
            return;
        }
        g_config.adc_sample_rate_hz = value;
        emit_ok();
        return;
    }

    if (string_equals(line, "ATSAMPLES?")) {
        emit_query_value_u32("SAMPLES", g_config.sample_count);
        emit_ok();
        return;
    }

    if (string_equals(line, "ATGO")) {
        if (capture_is_active()) {
            emit_error("BUSY");
            return;
        }
        switch (g_config.mode) {
        case CAPTURE_MODE_SINGLE:
            g_pending_frames = 1u;
            break;
        case CAPTURE_MODE_NSHOT:
            g_pending_frames = g_config.nshot;
            break;
        case CAPTURE_MODE_CONTINUOUS:
            g_continuous_active = true;
            break;
        default:
            emit_error("MODE");
            return;
        }
        emit_ok();
        return;
    }

    if (string_equals(line, "ATSTOP")) {
        g_continuous_active = false;
        g_pending_frames = 0u;
        emit_done_stopped();
        return;
    }

    if (string_equals(line, "ATDEFAULT")) {
        if (capture_is_active()) {
            emit_error("BUSY");
            return;
        }
        apply_default_configuration();
        emit_ok();
        return;
    }

    emit_error("UNKNOWN");
}

static void queue_completed_command(void)
{
    if (g_command_overflow) {
        g_pending_command_toolong = true;
        g_command_overflow = false;
        g_command_length = 0u;
        return;
    }

    if (g_command_length == 0u) {
        return;
    }

    g_command_buffer[g_command_length] = '\0';

    if (g_pending_command_ready) {
        g_pending_command_dropped = true;
    } else {
        memcpy(g_pending_command_buffer, g_command_buffer, g_command_length + 1u);
        g_pending_command_ready = true;
    }

    g_command_length = 0u;
}

static void pump_uart_rx(void)
{
    while (uart_rx_ready()) {
        const char byte = (char)uart_read_byte();

        if (byte == '\r') {
            continue;
        }

        if (byte == '\n') {
            queue_completed_command();
            continue;
        }

