jdesbonnet/codex_experiment_06/projects/ultrasonic_ranger/lpc824_c/main.c
        if (g_command_length + 1u >= AT_COMMAND_BUFFER_SIZE) {
            g_command_overflow = true;
            continue;
        }

        g_command_buffer[g_command_length++] = byte;
    }
}

static void service_pending_command(void)
{
    if (g_pending_command_toolong) {
        g_pending_command_toolong = false;
        emit_error("TOOLONG");
    }

    if (g_pending_command_dropped) {
        g_pending_command_dropped = false;
        emit_error("BUSY");
    }

    if (g_pending_command_ready) {
        g_pending_command_ready = false;
        handle_command(g_pending_command_buffer);
    }
}

void DMA0_IRQHandler(void)
{
    debug_pin_pulse(8u);
    DMA0->COMMON[0].INTA = dma_channel_mask(DMA_CHANNEL_ADC);
    ++g_dma_block_count;
}

void SCT0_IRQHandler(void)
{
    ++g_pulse_cycle_count;
    debug_pin_pulse(1u);
    SCT0->EVFLAG = 1u << 0;
}

int main(void)
{
    SystemCoreClockUpdate();

    enable_clock(SYSCON_SYSAHBCLKCTRL_GPIO_MASK);
    gpio_set_output(PIN_DEBUG);
    gpio_set_output(PIN_TRANSDUCER_TX_A);
    gpio_set_output(PIN_TRANSDUCER_TX_B);
    gpio_write(PIN_TRANSDUCER_TX_A, false);

    usart0_init();
    adc_init();

    emit_info();
    emit_config();

    while (1) {
        pump_uart_rx();
        service_pending_command();

        if (!capture_is_active()) {
            continue;
        }

        capture_frame();
        emit_current_frame();
        pump_uart_rx();
        service_pending_command();

        if (g_pending_frames > 0u) {
            --g_pending_frames;
            if (g_pending_frames == 0u && g_config.mode != CAPTURE_MODE_CONTINUOUS) {
                emit_done_frames((g_config.mode == CAPTURE_MODE_SINGLE) ? 1u : g_config.nshot);
            }
        }
    }
}
